<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html><head><title></title></head><body>
<h1>Zombiekeys</h1>
<br>
Zombiekeys works in the SeaMonkey web browser and Puppy's internal HTML viewer.<br>
<br>
Developer homepage:<br>
<a href="http://zombiekeys.bolay.us/">http://zombiekeys.bolay.us/</a> <br>
<br>
<p>The follow is extracted from the Developer homepage:</p>

Entering European languages (which include diacritics (accented
    characters, diaeresis, umlauts, etc.), ligatures, the Euro sign,
    etc.) or <a href="http://en.wikipedia.org/wiki/Heavy_metal_umlaut">Heavy 
    Metal Umlauts</a> into Mozilla applications using an English keyboard 
    doesn't  have to be a pain any more! This extension implements 
    <a href="http://office.microsoft.com/assistance/hfws.aspx?AssetID=HP051865621033">Microsoft's
    Keyboard shortcuts for international characters</a> (I've added shortcuts for &#8364;
    and &cent;). It addresses <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=270439">Mozilla 
    Bug #270439 (WinWord/TextPad dead keys are not supported)</a>.

    <span style="font-weight: bold;"><br>
<br>
</span>
<h2>Usage</h2>
For keyboard shortcuts in which you press two or more keys
simultaneously, the keys to press are separated by a plus sign (+) in
Microsoft Word Help. For keyboard shortcuts in which you press one key
immediately followed by another key, the keys to press are separated by
a comma (,). To type a lowercase character using a key combination that
includes the SHIFT key, hold down the CTRL+SHIFT+<i>symbol</i> keys simultaneously, and then release them before typing the letter.<br>
<p><span style="font-weight: bold;"><br>
</span></p>
<table border="1" cellpadding="1" cellspacing="0">
<tbody><tr><th>To do this</th><th>Press</th></tr>
	<tr><td>&agrave;, &egrave;, &igrave;, &ograve;, &ugrave;, &Agrave;, &Egrave;, &Igrave;, &Ograve;, &Ugrave;</td><td>CTRL+` (ACCENT GRAVE), <i>the letter</i></td></tr>
	<tr><td>&aacute;,
&eacute;, &iacute;, &oacute;, &uacute;, &yacute;, &Aacute;, &Eacute;,
&Iacute;, &Oacute;, &Uacute;, &Yacute;; &eth;, &ETH;</td><td>CTRL+' (APOSTROPHE), <i>the letter</i>; d or D</td></tr>
	<tr><td>&acirc;, &ecirc;, &icirc;, &ocirc;, &ucirc;, &Acirc;, &Ecirc;, &Icirc;, &Ocirc;, &Ucirc;</td><td>CTRL+SHIFT+^ (CARET), <i>the letter</i></td></tr>
	<tr><td>&atilde;, &ntilde;, &otilde;, &Atilde;, &Ntilde;, &Otilde;</td><td>CTRL+SHIFT+~ (TILDE), <i>the letter</i></td></tr>
	<tr><td>&auml;, &euml;, &iuml;, &ouml;, &uuml;, &yuml;, &Auml;, &Euml;, &Iuml;, &Ouml;, &Uuml;, &#376;</td><td>CTRL+SHIFT+: (COLON), <i>the letter</i></td></tr>
	<tr><td>&aring;, &Aring;</td><td>CTRL+SHIFT+@, a or A</td></tr>
	<tr><td>&aelig;, &AElig;; &#339;, &#338;; &szlig;</td><td>CTRL+SHIFT+&amp;, a or A; o or O; s</td></tr>
	<tr><td>&ccedil;, &Ccedil;</td><td>CTRL+, (COMMA), c or C</td></tr>
	<tr><td>&oslash;, &Oslash;, &cent;</td><td>CTRL+/, o or O or c</td></tr>
	<tr><td>&iquest;</td><td>CTRL+SHIFT+ALT+?</td></tr>
	<tr><td>&iexcl;</td><td>CTRL+SHIFT+ALT+!</td></tr>
	<tr><td>&#8364;</td><td>CTRL+ALT+E</td></tr>
	<tr><td>The Unicode character for the specified Unicode (hexadecimal) character code. <br>For example, to insert the euro currency symbol (&#8364;), type <kbd>20AC</kbd>, <br>and then hold down the ALT key and press X.</td><td><i>The character code</i>, ALT+X</td></tr>
	<tr><td>The <a href="http://en.wikipedia.org/wiki/Windows-1252">Windows-1252</a> character for the specified (decimal) character code.<br>For example, to insert the euro currency symbol (&#8364;), hold down the ALT key <br>and press 0128 on the numeric keypad.</td><td>ALT+<i>the character code</i> (on the numeric keypad)</td></tr>
    </tbody>
</table>


    <br>
<br>
</body></html>